# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:- [2, 3, 4, 5, 6] => [12, 15, 16]; - [2, 3, 5, 6] => [12, 15]

import math
my_list = [2, 3, 4, 5, 6]
stop = math.ceil(len(my_list)/2)
j =-1
for i in range(0,stop,1):
    sum = my_list[i]*my_list[j]
    print(sum)
    j=j-1











